Repository: quarkusio/es.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: es_es

source: Get instant feedback on code changes as tests run in the background on impacted code.
es_es: Obtenga información instantánea sobre los cambios en el código mientras las pruebas se ejecutan en segundo plano sobre el código afectado.

source: Get it running
es_es: Ponerlo en marcha

source: Get new and deeper views into Quarkus from the community through <a href="{{site.baseurl}}/books">these great books</a>.
es_es: Obtenga nuevos y más profundos puntos de vista sobre Quarkus de la comunidad a través de <a href="{{site.baseurl}}/books">estos magníficos libros</a>.

source: Getting Help from the Community
es_es: Obtener ayuda de la Comunidad

source: Getting Started
es_es: Primeros pasos

source: Getting Started to SmallRye Reactive Messaging with AMQP 1.0
es_es: Introducción a SmallRye Reactive Messaging con AMQP 1.0

source: Getting Started with Reactive
es_es: Introducción a Reactive

source: Given that only a single provider of a given capability is allowed in an application, capability prefixes allow expressing a certain common aspect among different but somewhat related capabilities. E.g. there could be extensions providing the following capabilities:
es_es: Dado que en una aplicación sólo se permite un único proveedor de una determinada capacidad, los prefijos de capacidad permiten expresar un cierto aspecto común entre capacidades diferentes pero algo relacionadas. Por ejemplo, puede haber extensiones que proporcionen las siguientes capacidades:

source: Going further
es_es: Ir más allá

source: Gone are the days of a thousand configuration files and formats. A single configuration file is all it takes for Quarkus applications to configure every single extension.
es_es: Atrás quedaron los días de mil archivos y formatos de configuración. Un solo archivo de configuración es todo lo que necesitan las aplicaciones de Quarkus para configurar cada una de las extensiones.

source: Google Cloud Functions (Serverless) with RESTEasy Reactive, Undertow, or Reactive Routes
es_es: Google Cloud Functions (Serverless) con RESTEasy Reactive, Undertow o Reactive Routes

source: GraalVM Native Executable support has been an essential part of the design for Quarkus from the beginning. When an application is compiled down to a native executable, it starts much faster and can run with a much smaller heap than a standard JVM. The native compiler uses aggressive dead-code elimination techniques to only embed the parts of the JVM and classes that are absolutely required by your application. Quarkus makes building optimized native executables plain easy. The build-time approach allows Quarkus to collect enough metadata on your application to fine-tune the compilation. No <code>-H:+ReportUnsupportedElementsAtRuntime</code> flag, no fallback, no compromise!
es_es: El soporte de ejecutables nativos de GraalVM ha sido una parte esencial del diseño de Quarkus desde el principio. Cuando una aplicación se compila a un ejecutable nativo, se inicia mucho más rápido y puede ejecutarse con un montón mucho más pequeño que una JVM estándar. El compilador nativo utiliza técnicas agresivas de eliminación de código muerto para incrustar sólo las partes de la JVM y las clases que son absolutamente necesarias para su aplicación. Quarkus hace que la construcción de ejecutables nativos optimizados sea muy fácil. El enfoque en tiempo de construcción permite a Quarkus recoger suficientes metadatos sobre su aplicación para ajustar la compilación. ¡No hay flag <code>-H:+ReportUnsupportedElementsAtRuntime</code>, no hay fallback, no hay compromiso!

source: Gradle (Kotlin DSL)
es_es: Gradle (DSL de Kotlin)

source: Gradle build
es_es: Construcción de Gradle

source: Guides
es_es: Guías

source: Handling failures
es_es: Gestión de fallos

source: Handling security issues
es_es: Manejo de problemas de seguridad

source: Having access to an Azure subscription. https://azure.microsoft.com/free/?WT.mc_id=opensource-quarkus-brborges[Get a free one here]
es_es: Tener acceso a una suscripción a Azure. https://azure.microsoft.com/free/?WT.mc_id=opensource-quarkus-brborges[Obtenga una gratuita aquí]

source: Health UI
es_es: IU de la Salud

source: Health reporting
es_es: Informes de salud

source: Here is the list of all the Quarkus Maven Plugin goals:
es_es: Aquí está la lista de todos los objetivos de Quarkus Maven Plugin:

source: Here you can find a list of Build Items and the extension that provides them:
es_es: Aquí puede encontrar una lista de elementos de construcción y la extensión que los proporciona:

source: Here's an example of using a POJO as input and output types.
es_es: Aquí hay un ejemplo de uso de un POJO como tipos de entrada y salida.

source: Heroku can be used in different ways to run a Quarkus application:
es_es: Heroku se puede utilizar de diferentes maneras para ejecutar una aplicación Quarkus:

source: Hit `CTRL+C` to stop the application, or keep it running and enjoy the blazing fast hot-reload.
es_es: Pulsa `CTRL+C` para detener la aplicación, o mantenla en funcionamiento y disfruta de la rapidísima recarga en caliente.

source: How to re-augment a Quarkus application
es_es: Cómo volver a aumentar una aplicación de Quarkus

source: However, HTTP characteristics prohibit implementing <a href="https://www.reactivemanifesto.org/">reactive systems</a>, where all the components interact using asynchronous messages passing.
es_es: Sin embargo, las características de HTTP prohíben implementar <a href="https://www.reactivemanifesto.org/">sistemas reactivos</a>, en los que todos los componentes interactúan utilizando el paso de mensajes asíncronos.

source: However, you can go right to the completed example.
es_es: Sin embargo, puede ir directamente al ejemplo completo.

source: Identity providers
es_es: Proveedores de identidad

source: If `api-version` is not set, the latest version for the given flavor will be used. Otherwise, the version must match a https://github.com/dajudge/kindcontainer/blob/master/k8s-versions.json[version supported by the given flavor].
es_es: Si no se define `api-version`, se utilizará la versión más reciente para el tipo dado. De lo contrario, la versión debe coincidir con una https://github.com/dajudge/kindcontainer/blob/master/k8s-versions.json[versión soportada por el sabor] dado.

source: If `quarkus-extension-b` wasn't declared as `<optional>true</optional>` that would make `quarkus-extension-b` a required dependency of `quarkus-extension-a` and its dependency condition would be ignored.
es_es: Si `quarkus-extension-b` no fuera declarado como `<optional>true</optional>` eso haría que `quarkus-extension-b` fuera una dependencia requerida de `quarkus-extension-a` y su condición de dependencia sería ignorada.

source: If an AMQP message is rejected/released/modified by the broker (or cannot be sent successfully), the message is nacked.
es_es: Si un mensaje AMQP es rechazado/liberado/modificado por el broker (o no puede ser enviado con éxito), el mensaje es nacked.

source: If an extension was configured with a dependency condition in its descriptor, other extensions may configure a conditional dependency on it by simply adding `<optional>true</optional>` to the dependency configuration. In our example it would look like this:
es_es: Si una extensión fue configurada con una condición de dependencia en su descriptor, otras extensiones pueden configurar una dependencia condicional sobre ella simplemente añadiendo `<optional>true</optional>` a la configuración de la dependencia. En nuestro ejemplo se vería así:

source: If it's your first time to install, you'll need to restart your shell.
es_es: Si es la primera vez que se instala, tendrá que reiniciar el shell.

source: If no registry is set (using `quarkus.container-image.registry`) then `docker.io` will be used as the default.
es_es: Si no se establece ningún registro (utilizando `quarkus.container-image.registry`), se utilizará `docker.io` por defecto.

source: If one extension requires a certain capability, there must be another one among the application dependencies that provides that capability, otherwise the build will fail with the corresponding error message.
es_es: Si una extensión requiere una determinada capacidad, debe haber otra entre las dependencias de la aplicación que proporcione esa capacidad, de lo contrario la construcción fallará con el correspondiente mensaje de error.

source: If set, configure the hostname value used for the connection AMQP Open frame and TLS SNI server name (if TLS is in use) Type: _string_
es_es: Si se establece, configure el valor del nombre de host utilizado para la trama abierta AMQP de la conexión y el nombre del servidor SNI TLS (si se utiliza TLS) Type: _string_

source: If set, explicitly override the hostname to use for the TLS SNI server name Type: _string_
es_es: Si se establece, anula explícitamente el nombre de host que se utilizará para el nombre del servidor TLS SNI Type: _string_

source: If the `address` attribute is not set, the connector uses the channel name.
es_es: Si el atributo `address` no está establecido, el conector utiliza el nombre del canal.

source: If the connector cannot extract the Cloud Event metadata, it sends the Message without the metadata.
es_es: Si el conector no puede extraer los metadatos del evento en la nube, envía el mensaje sin los metadatos.

source: If the message payload cannot be serialized to JSON, the message is _nacked_.
es_es: Si la carga útil del mensaje no puede ser serializada a JSON, el mensaje es _nacked_.

source: If the user name is `Alice` and the password is `secret`, the HTTP authorization header would be `Authorization: Basic QWxjZTpzZWNyZXQ=`, where `QWxjZTpzZWNyZXQ=` is a Base64 encoded representation of the `Alice:secret` string.
es_es: Si el nombre de usuario es `Alice` y la contraseña es `secret`, la cabecera de autorización HTTP sería `Authorization: Basic QWxjZTpzZWNyZXQ=`, donde `QWxjZTpzZWNyZXQ=` es una representación codificada en Base64 de la cadena `Alice:secret`.

source: If using Powershell , wrap `-D` parameters in double quotes e.g. `"-DprojectArtifactId=getting-started"`
es_es: Si utiliza Powershell, envuelva los parámetros de `-D` entre comillas dobles, por ejemplo `"-DprojectArtifactId=getting-started"`

source: If we focus on the dependencies section, you can see the extension allowing the development of REST applications:
es_es: Si nos centramos en la sección de dependencias, se puede ver la extensión que permite el desarrollo de aplicaciones REST:

source: If you are a Java EE or Spring user, this development model should look familiar. You expose a resource containing methods annotated with <code>@GET</code>, <code>@POST</code>…&ZeroWidthSpace;&ZeroWidthSpace; to handle the different requests. The path is specified using the <code>@Path</code> annotation. Quarkus also supports <a href="https://quarkus.io/guides/spring-web">Spring controller</a> annotations such as <code>@GetMapping</code> or <code>@RestController</code>.
es_es: Si eres un usuario de Java EE o Spring, este modelo de desarrollo debería resultarte familiar. Se expone un recurso que contiene métodos anotados con <code>@GET</code>, <code>@POST</code>…&ZeroWidthSpace;&ZeroWidthSpace; ... para manejar las diferentes peticiones. La ruta se especifica utilizando la anotación <code>@Path</code>. Quarkus también soporta anotaciones del <a href="https://quarkus.io/guides/spring-web">Controlador de Spring</a> como <code>@GetMapping</code> or <code>@RestController</code>.

source: If you are a Quarkus user or just curious, don't be shy and join our welcoming community:
es_es: Si eres un usuario de Quarkus o simplemente tienes curiosidad, no seas tímido y únete a nuestra acogedora comunidad:

source: If you are an extension developer or want to contribute to Quarkus development, join our mailing list either <a href="mailto:quarkus-dev+subscribe@googlegroups.com">emailing us</a> or by visiting our <a href="https://groups.google.com/d/forum/quarkus-dev">Google Groups page</a>. Make sure you visit our extensive <a href="{{site.baseurl}}/guides/writing-extensions">Writing extensions guide</a>.
es_es: Si eres un desarrollador de extensiones o quieres contribuir al desarrollo de Quarkus, únete a nuestra lista de correo ya sea <a href="mailto:quarkus-dev+subscribe@googlegroups.com">escríbenos un correo</a> o visitando nuestra <a href="https://groups.google.com/d/forum/quarkus-dev">página de Grupos de Google</a>. Asegúrese de visitar nuestra extensa <a href="{{site.baseurl}}/guides/writing-extensions">Guía de extensiones de escritura</a>.

source: If you are not in one of these cases, the compression fails.
es_es: Si no está en uno de estos casos, la compresión falla.

source: If you configure Quarkus to use the same port for both HTTP and gRPC servers with the property `quarkus.grpc.server.use-separate-server=false`, then you don't need to change the default `target-port`.
es_es: Si configuras Quarkus para usar el mismo puerto para ambos servidores HTTP y gRPC con la propiedad `quarkus.grpc.server.use-separate-server=false`, entonces no necesitas cambiar el valor por defecto `target-port`.

source: If you correctly followed the xref:building-native-image.adoc[building native image guide], you should have a local container image named `quarkus-quickstart/getting-started`.
es_es: Si ha seguido correctamente la xref:building-native-image.html[guía de construcción de imágenes nativas], debería tener una imagen de contenedor local llamada `quarkus-quickstart/getting-started`.

source: If you don't need endpoints of each type, you can remove the corresponding extensions from your `pom.xml`.
es_es: Si no necesita endpoints de cada tipo, puede eliminar las extensiones correspondientes de su `pom.xml`.

source: If you don't want to follow all these steps, you can go right to the completed example.
es_es: Si no quieres seguir todos estos pasos, puedes ir directamente al ejemplo completo.

source: If you enable the `staging` profile, the HTTP port will be 8082, whereas it would be 8081 otherwise.
es_es: Si habilita el perfil `staging`, el puerto HTTP será el 8082, mientras que en caso contrario sería el 8081.

source: If you ever want to build a native container image and already have an existing native image you can set `-Dquarkus.native.reuse-existing=true` and the native image build will not be re-run.
es_es: Si alguna vez quiere construir una imagen de contenedor nativo y ya tiene una imagen nativa existente, puede establecer `-Dquarkus.native.reuse-existing=true` y la construcción de la imagen nativa no se volverá a ejecutar.

source: If you need to have access to the full AWT support, you need more than just `libfreetype.so`, but also the font and font configurations:
es_es: Si necesita tener acceso al soporte completo de AWT, necesita algo más que `libfreetype.so`, sino también la fuente y las configuraciones de fuente:

source: If you require a higher level of support, you have options.
es_es: Si necesita un mayor nivel de apoyo, tiene opciones.

source: If you use Basic or form-based authentication, you must add an `IdentityProvider` instance to convert a username and password to a `SecurityIdentity` instance.
es_es: Si utiliza autenticación básica o basada en formularios, debe añadir una instancia `IdentityProvider` para convertir un nombre de usuario y una contraseña en una instancia `SecurityIdentity`.

source: If you want to deploy your application somewhere (typically in a container), you need to deploy the whole `quarkus-app` directory.
es_es: Si quieres desplegar tu aplicación en algún lugar (normalmente en un contenedor), necesitas desplegar todo el directorio `quarkus-app`.

source: If you want to use Redis Stack _modules_ (bloom, graph, search...), set the image-name to `redis/redis-stack:latest`
es_es: Si desea utilizar _los módulos_ Redis Stack (bloom, graph, search...), defina el nombre de la imagen como `redis/redis-stack:latest`

source: If you've followed the build native image guide, you should have a local container image named `quarkus-quickstart/getting-started`.
es_es: Si ha seguido la guía de creación de imágenes nativas, debería tener una imagen de contenedor local llamada `quarkus-quickstart/getting-started`.

source: If your application does not use any Quarkus extension that exposes an HTTP server, you can still configure the probes to directly use the gRPC Health service by adding the property `quarkus.kubernetes.readiness-probe.grpc-action-enabled=true` into your configuration:
es_es: Si su aplicación no utiliza ninguna extensión de Quarkus que exponga un servidor HTTP, aún puede configurar las sondas para que utilicen directamente el servicio gRPC Health añadiendo la propiedad `quarkus.kubernetes.readiness-probe.grpc-action-enabled=true` en su configuración:

source: If your method is annotated with `@Transactional`, it will be considered _blocking_ automatically, even if the method is not annotated with `@Blocking`.
es_es: Si su método está anotado con `@Transactional`, se considerará automáticamente _bloqueante_, incluso si el método no está anotado con `@Blocking`.

source: Imperative
es_es: Imperativo

source: Imperative and reactive code
es_es: Código imperativo y reactivo

source: Improve and expedite the inner loop development process with live coding where code changes are automatically reflected in your running application. code -> refresh browser -> repeat
es_es: Mejore y agilice el proceso de desarrollo interno con la codificación en vivo, donde los cambios de código se reflejan automáticamente en su aplicación en ejecución. código → actualizar navegador → repetir

source: In 2017, the technical team’s first attempt at exposing an API was using Node.js + Express. As the request volume and number of distribution variants rose, the team found that the response times were getting slower, not only due to the volume, but also due to architectural choices made early on. In particular, the application’s monolithic architecture, where the frontend and backend were in the same app, would cause apparent slowness in the frontend, while the backend processed concurrent requests. In addition, lack of pagination in the API meant that requests could return huge results, even when only the first few elements of the result were needed.
es_es: En 2017, el primer intento del equipo técnico de exponer una API fue utilizando Node.js + Express. A medida que el volumen de solicitudes y el número de variantes de distribución aumentaban, el equipo descubrió que los tiempos de respuesta eran cada vez más lentos, no solo por el volumen, sino también por las decisiones arquitectónicas tomadas al principio. En particular, la arquitectura monolítica de la aplicación, en la que el frontend y el backend se encontraban en la misma aplicación, provocaba una aparente lentitud en el frontend, mientras el backend procesaba peticiones concurrentes. Además, la falta de paginación en la API significaba que las solicitudes podían devolver resultados enormes, incluso cuando sólo se necesitaban los primeros elementos del resultado.

source: In July 2019 the team discovered Quarkus through its related work with other frameworks in the Java ecosystem. They were especially interested in Quarkus’ promise of stellar performance and smaller footprint, which is comparable to Node.js and even Golang. Even better, Quarkus’ https://quarkus.io/guides/kotlin[first class support for Kotlin^] meant the team could re-use both their Java and Kotlin experience with Quarkus.
es_es: En julio de 2019, el equipo descubrió Quarkus a través de su trabajo relacionado con otros frameworks del ecosistema Java. Estaban especialmente interesados en la promesa de Quarkus de un rendimiento estelar y una huella más pequeña, que es comparable a Node.js e incluso a Golang. Incluso mejor, el https://quarkus.io/guides/kotlin[soporte de primera clase de Quarkus para Kotlin^] significaba que el equipo podía reutilizar tanto su experiencia en Java como en Kotlin con Quarkus.

source: In a Gradle project, you would find a similar setup:
es_es: En un proyecto Gradle, se encontraría una configuración similar:

source: In a production application, the aforementioned class loading infrastructure is entirely absent - there is a single, purpose built ClassLoader that loads (almost) all classes and dependencies.
es_es: En una aplicación de producción, la mencionada infraestructura de carga de clases está totalmente ausente - hay un único ClassLoader construido a propósito que carga (casi) todas las clases y dependencias.

source: In addition to the generic container image options, the `container-image-docker` also provides the following options:
es_es: Además de las opciones genéricas de la imagen del contenedor, `container-image-docker` también proporciona las siguientes opciones:

source: In addition to the generic container image options, the `container-image-jib` also provides the following options:
es_es: Además de las opciones genéricas de la imagen del contenedor, `container-image-jib` también proporciona las siguientes opciones:

source: In addition, remember to enable the AWS X-Ray tracing parameter in `manage.sh`, in the `cmd_create()` function. This can also be set in the AWS Management Console.
es_es: Además, recuerde habilitar el parámetro de rastreo de AWS X-Ray en `manage.sh`, en la función `cmd_create()`. Esto también se puede configurar en la consola de administración de AWS.

source: In addition, the xref:tooling.adoc[tooling guide] document explains how to:
es_es: Además, el documento xref:tooling.adoc[Guía de herramientas] explica cómo:

source: In case you are interested in using the `Liquibase` object directly, you can inject it as follows:
es_es: En caso de que esté interesado en utilizar el objeto `Liquibase` directamente, puede inyectarlo de la siguiente manera:

source: In dev mode and when running tests, xref:amqp-dev-services.adoc[Dev Services for AMQP] automatically starts an AMQP broker.
es_es: En el modo dev y cuando se ejecutan pruebas, xref:amqp-dev-services.html[Dev Services for AMQP] inicia automáticamente un broker AMQP.

source: In general, for every runtime extension artifact dependency on another runtime extension artifact there must be a corresponding deployment extension artifact dependency on the other deployment extension artifact. And if the runtime dependency is declared as optional then the corresponding deployment dependency **must** also be configured as optional.
es_es: En general, para cada dependencia de un artefacto de extensión en tiempo de ejecución de otro artefacto de extensión en tiempo de ejecución debe haber una dependencia correspondiente de un artefacto de extensión de despliegue de otro artefacto de extensión de despliegue. Y si la dependencia de tiempo de ejecución se declara como opcional, entonces la dependencia de despliegue correspondiente también **debe** configurarse como opcional.

source: In order to re-augment your Quarkus application with different build time properties, start the application with the desired configuration plus the `quarkus.launch.rebuild` system property set to `true`.
es_es: Para volver a aumentar su aplicación Quarkus con diferentes propiedades de tiempo de compilación, inicie la aplicación con la configuración deseada más la propiedad del sistema `quarkus.launch.rebuild` establecida en `true`.

source: In our case, we want to configure the `address` attribute to indicate the name of the queue.
es_es: En nuestro caso, queremos configurar el atributo `address` para indicar el nombre de la cola.
